In [ ]:
import pandas as pd
pd.__version__

In [3]:
#pierwsza tabela
df=pd.DataFrame(data=[12,12,31])
df

    0
0  12
1  12
2  31

In [7]:
#dodajemy opisy wierszy i kolumn
df=pd.DataFrame(data=[12,12,31], index=['first','second','third'], columns=['col 1'])
df

        col 1
first      12
second     12
third      31

In [10]:
df=pd.DataFrame(data={'WIG20': ['PKN ORLEN','PKO BP'],
                     'mWIG40':['Amica','Playway']})
df

       WIG20   mWIG40
0  PKN ORLEN    Amica
1     PKO BP  Playway

In [11]:
df=pd.DataFrame(data=[[10,12,13],[23,12,10]],index=['first','second'], columns=['col_1','col_2','col_3'])
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [12]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [13]:
df.index

Index(['first', 'second'], dtype='object')

In [14]:
df.values

array([[10, 12, 13],
       [23, 12, 10]], dtype=int64)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, first to second
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   2 non-null      int64
 1   col_2   2 non-null      int64
 2   col_3   2 non-null      int64
dtypes: int64(3)
memory usage: 64.0+ bytes

In [17]:
#Wyświetla najważniejsze parametry
df.describe()

           col_1  col_2     col_3
count   2.000000    2.0   2.00000
mean   16.500000   12.0  11.50000
std     9.192388    0.0   2.12132
min    10.000000   12.0  10.00000
25%    13.250000   12.0  10.75000
50%    16.500000   12.0  11.50000
75%    19.750000   12.0  12.25000
max    23.000000   12.0  13.00000

In [18]:
df.describe().T

       count  mean       std   min    25%   50%    75%   max
col_1    2.0  16.5  9.192388  10.0  13.25  16.5  19.75  23.0
col_2    2.0  12.0  0.000000  12.0  12.00  12.0  12.00  12.0
col_3    2.0  11.5  2.121320  10.0  10.75  11.5  12.25  13.0

In [19]:
#SELEKCJA KOLUMN
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [20]:
df['col_1']

first     10
second    23
Name: col_1, dtype: int64

In [21]:
#typ series
type(df['col_1'])

pandas.core.series.Series

In [22]:
df[['col_1']]

        col_1
first      10
second     23

In [23]:
#typ DataFrame (2 nawiasy kwadratowe)
type(df[['col_1']])

pandas.core.frame.DataFrame

In [30]:
df.columns=['a','sprzedaz_grudzien','c']
df

         a  sprzedaz_grudzien   c
first   10                 12  13
second  23                 12  10

In [25]:
df.a

first     10
second    23
Name: a, dtype: int64

In [31]:
df.sprzedaz_grudzien

first     12
second    12
Name: sprzedaz_grudzien, dtype: int64

In [34]:
df['d']=df.a+df.c
df

         a  sprzedaz_grudzien   c   d
first   10                 12  13  23
second  23                 12  10  33

In [35]:
df=pd.DataFrame(data=[[10,12,13],[23,12,10]],index=['first','second'], columns=['col_1','col_2','col_3'])
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [36]:
df.loc['first']

col_1    10
col_2    12
col_3    13
Name: first, dtype: int64

In [37]:
#po indexie kolumny
df.iloc[0]

col_1    10
col_2    12
col_3    13
Name: first, dtype: int64

In [38]:
#wycinamy dokladnie 1 komórke
df.loc['first','col_2']

12

In [39]:
df.loc[:,'col_2']

first     12
second    12
Name: col_2, dtype: int64

In [40]:
df.iloc[0,1]

12

In [41]:
df.iloc[:,2]

first     13
second    10
Name: col_3, dtype: int64